docs/_posts/2022-11-08-ros-lsp-and-doom.html
---
title: Doom, ROS2 and lsp-docker
date: 2022-11-10 21:00:00 +01:00
modifications:
- [2022-11-20, "Changed info about :path-mappings."]
tags: [emacs, lsp, docker, doom, ros2, ros, lsp-docker]
description: How to get lsp-docker running with doom emacs for ROS projects.
image: doom_ros2_lsp_docker.png
---

<p>
While going through a <a href="https://www.udemy.com/course/ros2-for-beginners/">udemy course</a> for <a href="https://www.ros.org/">ROS2</a> I realized that installing ROS on Arch wasn&rsquo;t as easy as a <code>yay</code> away. Here I&rsquo;ll explain how I use <a href="https://github.com/emacs-lsp/lsp-docker">lsp-docker</a> to get a docker container with the ROS2 libraries installed which can run a LSP server for doom emacs. This way I can get proper LSP support even though I don&rsquo;t have the libraries installed on my computer.
</p>

<div id="outline-container-orga62cf4c" class="outline-2">
<h2 id="orga62cf4c">How?</h2>
<div class="outline-text-2" id="text-orga62cf4c">
<p>
First we need to tell doom to install the package we&rsquo;re about to use.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>~/.doom.d/packages.el</label><pre class="src src-emacs-lisp">...
<span style="color: #51afef;">(</span><span style="color: #51afef;">package!</span> lsp-docker<span style="color: #51afef;">)</span>
...
</pre>
</div>

<p>
We then tell doom to let the package take over when it comes to starting a LSP server. But only for specific languages, Python and C++. And only while beneath a specific path.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>~/.doom.d/config.el</label><pre class="src src-emacs-lisp">...
<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> lsp-docker
  <span style="color: #c678dd;">:config</span>
   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">For which LSP clients do we want to hijack the server starting?</span>
   <span style="color: #c678dd;">(</span><span style="color: #51afef;">defvar</span> <span style="color: #dcaeea;">lsp-docker-client-packages</span>
    <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #dcaeea;">lsp-clients</span> lsp-pylsp lsp-clangd<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>

   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">The settings for this hijacking</span>
   <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> lsp-docker-client-configs
    <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span><span style="color: #c678dd;">:server-id</span> clangd
       <span style="color: #c678dd;">:docker-server-id</span> clangd-docker
       <span style="color: #c678dd;">:server-command</span> <span style="color: #98be65;">"ccls"</span>
       <span style="color: #c678dd;">:docker-image-id</span>  <span style="color: #98be65;">"0x57/ccls-ros-lsp"</span>
       <span style="color: #c678dd;">:docker-container-name</span> <span style="color: #98be65;">"0x57-cpp-ros-lsp"</span><span style="color: #a9a1e1;">)</span>
      <span style="color: #a9a1e1;">(</span><span style="color: #c678dd;">:server-id</span> pylsp
       <span style="color: #c678dd;">:docker-server-id</span> pylsp-docker
       <span style="color: #c678dd;">:server-command</span> <span style="color: #98be65;">"pylsp"</span>
       <span style="color: #c678dd;">:docker-image-id</span> <span style="color: #98be65;">"0x57/pylsp-ros-lsp"</span>
       <span style="color: #c678dd;">:docker-container-name</span> <span style="color: #98be65;">"0x57-py-ros-lsp"</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>

   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">Initalize above</span>
   <span style="color: #c678dd;">(</span><span style="color: #c678dd;">lsp-docker-init-clients</span>
    <span style="color: #c678dd;">:path-mappings</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>
                    <span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"/path/to/a/project/on/host"</span>  . <span style="color: #98be65;">"/path/to/mount/it/in/container"</span><span style="color: #a9a1e1;">)</span>
                    <span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"/path/to/another/project/on/host"</span> . <span style="color: #98be65;">"/path/to/mount/it/in/container"</span><span style="color: #a9a1e1;">)</span>
                     <span style="color: #98be65;">)</span>
    <span style="color: #c678dd;">:client-packages</span> <span style="color: #dcaeea;">lsp-docker-client-packages</span>
    <span style="color: #c678dd;">:client-configs</span> lsp-docker-client-configs<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
...
</pre>
</div>

<p>
We&rsquo;re using custom docker images which is why we specify <code>:docker-image-id</code>. We do this since they need to contain ROS and other related libraries (otherwise LSP wouldn&rsquo;t be able to find them). These images have to be pulled first with <code>docker pull 0x57/ccls-ros-lsp</code> for the package to be able to start them. See listing <a href="#org22a02dc">3</a> and <a href="#org2a03cc0">4</a> for the images setup. We&rsquo;re naming the containers since it&rsquo;s demanded by the package. <code>:path-mappings</code> allows us to tell the package to mount different projects under different paths in the container. With the help of this, and a <a href="https://clang.llvm.org/docs/JSONCompilationDatabase.html">compile_commands.json</a> file in the project root (e.g. <code>/path/to/a/project/on/host</code>), LSP will be able to find project specific files that might be needed. Such as project libraries.
</p>

<p>
With this done you should be able to open a C++/Python file beneath any of the given project paths and the package should start a container with the specified LSP server. You can check if the container shows up with <code>docker container ps</code>.
</p>
</div>
</div>

<div id="outline-container-orga298b4a" class="outline-2">
<h2 id="orga298b4a">The dockerfiles</h2>
<div class="outline-text-2" id="text-orga298b4a">
<p>
The image used by the docker container that start LSP for C++ is shown below.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Dockerfile for image &ldquo;0x57/ccls-ros-lsp&rdquo;</label><pre class="src src-dockerfile" id="org22a02dc"><span style="color: #51afef;">FROM</span> <span style="color: #ECBE7B; font-weight: bold;">ros:foxy</span>

<span style="color: #51afef;">RUN</span> apt-get update <span style="color: #98be65;">\</span>
    &amp;&amp; apt-get upgrade -y <span style="color: #98be65;">\</span>
    &amp;&amp; apt-get install -y ccls <span style="color: #98be65;">\</span>
      ros-${<span style="color: #dcaeea;">ROS_DISTRO</span>}-demo-nodes-cpp
</pre>
</div>

<p>
Every concievable thing related to ROS2 foxy won&rsquo;t be installed from this. As time moves on you might find yourself with a missing library, and thus have to extend the dockerfile. A bit more has to be done for the Python LSP server, but not that much.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Dockerfile for image &ldquo;0x57/pylsp-ros-lsp&rdquo;</label><pre class="src src-dockerfile" id="org2a03cc0"><span style="color: #51afef;">FROM</span> <span style="color: #ECBE7B; font-weight: bold;">ros:foxy</span>

<span style="color: #51afef;">RUN</span> apt-get update <span style="color: #98be65;">\</span>
    &amp;&amp; apt-get upgrade -y <span style="color: #98be65;">\</span>
    &amp;&amp; apt-get install -y python3-pip git

<span style="color: #51afef;">RUN</span> mkdir -p rclpy_ws/src
<span style="color: #51afef;">WORKDIR</span> rclpy_ws/src
<span style="color: #51afef;">RUN</span> git clone https://github.com/ros2/rclpy.git
<span style="color: #51afef;">WORKDIR</span> rclpy_ws
<span style="color: #51afef;">RUN</span> colcon build --symlink-install

<span style="color: #51afef;">RUN</span> pip install python-lsp-server
</pre>
</div>

<p>
Both images will be updated to work with the udemy course. So if you&rsquo;re following that, you might not have to update these dockerfiles and can just pull the ones I&rsquo;ve already built.
</p>
</div>
</div>
